<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"6bc3cd16fd7dbd0a3f83f503fd880910c9ac6e37fd358f5ec24f7319e21c220f","plan_job_ref":"Job Infrastructure Continuous Deployment #35 at https://github.com/sethltaylor/Bird-Sighting-Tracker/actions/runs/8117479155","plan_out_hash":"51c6cc6341ea1bf8610e1b7562dc79a48e8bbc461f389070027e3ff17c950f67","plan_hash":"dde528da681e694263754985dd9f774fc8ccf53c554d8de002791e6122bc69a9","plan_text_format":"diff","version":"1.42.0","closed":true} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 3 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.bird_tracker_service will be updated in-place
!~  resource "aws_ecs_service" "bird_tracker_service" {
        id                                 = "arn:aws:ecs:us-east-1:851725613770:service/bird-tracker-cluster/bird-tracker-service"
        name                               = "bird-tracker-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:us-east-1:851725613770:task-definition/bird-tracker:8" -> (known after apply)
#        (14 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.bird_tracker_task must be replaced
-/+ resource "aws_ecs_task_definition" "bird_tracker_task" {
!~      arn                      = "arn:aws:ecs:us-east-1:851725613770:task-definition/bird-tracker:8" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-east-1:851725613770:task-definition/bird-tracker" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
!~                  image        = "public.ecr.aws/w2n2l6t8/bird-tracker-repo" -> "public.ecr.aws/w2n2l6t8/bird-tracker-repo:latest"
-                   mountPoints  = []
                    name         = "bird-tracker"
-                   volumesFrom  = []
#                    (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "************" -> (known after apply)
+       network_mode             = (known after apply)
!~      revision                 = 8 -> (known after apply)
-       tags                     = {} -> null
!~      tags_all                 = {} -> (known after apply)
#        (5 unchanged attributes hidden)
    }

  # aws_lambda_function.recent_observations will be updated in-place
!~  resource "aws_lambda_function" "recent_observations" {
        id                             = "recent_observations"
!~      last_modified                  = "2024-03-01T02:14:46.000+0000" -> (known after apply)
!~      source_code_hash               = "66PkmkTR9P40wOzTIFf1Mv0JmZdwpqUjCojwnqekJ3Q=" -> "GWZaroRYy4MXuP0VE62zF17WbG536h2yjMYtrduMqP0="
        tags                           = {}
#        (22 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # aws_s3_object.lambda_zip will be updated in-place
!~  resource "aws_s3_object" "lambda_zip" {
!~      etag                   = "504b7a0aab0fe2df0673bacdd0870e79-6" -> "d1eb6c64377c47a23b8a86717e1baaf3"
        id                     = "recent_observations_lambda_deployment_package.zip"
        tags                   = {}
!~      version_id             = "********************************" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Infrastructure Continuous Deployment #36](https://github.com/sethltaylor/Bird-Sighting-Tracker/actions/runs/8117539624)
<details open><summary>Outputs</summary>

```hcl
recent_observation_table_arn   = "arn:aws:dynamodb:us-east-1:851725613770:table/RecentObservations"
recent_observations_table_name = "RecentObservations"
```
</details>